In [ ]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1      Fisika     49     perempuan   12A
1         2  Matematika      4     laki-laki   12B
2         3  Matematika     70     laki-laki   12D
3         4  Matematika     99     laki-laki   12B
4         5  Matematika     57     perempuan   12D

<h2>Quiz 1 : Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [ ]:
# code here

print(df[['nilai' , 'kelas']])

print(df.loc[5:10,['nilai' , 'kelas']])

    nilai kelas
0      49   12A
1       4   12B
2      70   12D
3      99   12B
4      57   12D
5      78   12A
6      90   12D
7      54   12B
8      72   12C
9      28   12C
10      6   12B
11     65   12A
12      4   12A
13     25   12B
14     12   12B
15     42   12D
16     57   12A
17     19   12A
18     70   12D
19     34   12C
    nilai kelas
5      78   12A
6      90   12D
7      54   12B
8      72   12C
9      28   12C
10      6   12B

<h2>Quiz 2 : Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [ ]:
# code here
eko = df.pelajaran == 'Ekonomi'
fis = df.pelajaran == 'Fisika'

print(df[(eko) | (fis)])

nil5 = df.nilai > 50
kim = df.pelajaran == 'Kimia'

print(df[(kim) & (nil5)])

nil7 = df.nilai > 70 
kelas = df.kelas == '12C'
perem = df['jenis-kelamin'] == 'perempuan'

print(df[(nil7) & (kelas) & (perem)])

    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1    Fisika     49     perempuan   12A
7          8   Ekonomi     54     perempuan   12B
9         10    Fisika     28     perempuan   12C
15        16    Fisika     42     laki-laki   12D
    siswa_id pelajaran  nilai jenis-kelamin kelas
8          9     Kimia     72     perempuan   12C
18        19     Kimia     70     perempuan   12D
   siswa_id pelajaran  nilai jenis-kelamin kelas
8         9     Kimia     72     perempuan   12C

<h2>Quiz 3 : Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![image.png](attachment:image.png)

In [ ]:
# code here
def normalisasi(masuk):
  return (masuk-masuk.min())/(masuk.max()-masuk.min())

print(df[['nilai']].apply(normalisasi))

       nilai
0   0.473684
1   0.000000
2   0.694737
3   1.000000
4   0.557895
5   0.778947
6   0.905263
7   0.526316
8   0.715789
9   0.252632
10  0.021053
11  0.642105
12  0.000000
13  0.221053
14  0.084211
15  0.400000
16  0.557895
17  0.157895
18  0.694737
19  0.315789